<a href="https://colab.research.google.com/github/sg18785/python/blob/main/Structured_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Problem Statement 01



Create a table with the schema as specified below and load the data.

In [ ]:
CREATE TABLE my_table (
  id INT,
  tenure INT,
  designation VARCHAR(255),
  salary BIGINT
);

Write a query to derive a new column extra_vacation based on the tenure served, the logic is as
given below.
1. If tenure < 2, Then 20
2. If tenure is 2-10 then 30 days
3. If tenure > 10 then 40 days

In [ ]:
SELECT
  id,
  tenure,
  CASE
    WHEN tenure < 2 THEN 20
    WHEN tenure BETWEEN 2 AND 10 THEN 30
    ELSE 40
  END AS extra_vacation
FROM
  employee;

Problem Statement 02

Create a table “temperature” to store the dataset as mentioned in the schema and load the data.

In [ ]:
-- Create the temperature table
CREATE TABLE temperature (
    date_string VARCHAR(20),
    state VARCHAR(50),
    temperature ARRAY<double>
);

Write a query to calculate the maximum temperature of each state.

In [ ]:
SELECT
    state,
    MAX(temperature_value) AS max_temperature
FROM
    temperature
CROSS JOIN UNNEST(temperature) AS temperature_value
GROUP BY
    state;

Problem Statement 03

Create a table 'student_marks' with schema as shown above and load the data into the
'student_marks' table.

In [ ]:
CREATE TABLE student_marks (
  name VARCHAR(50),
  marks_json JSON -- Use JSON data type to store the marks as a JSON object
);

Display NAME who have scored more than 90 in the Maths subject:
sql

In [ ]:
SELECT name
FROM student_marks
WHERE CAST(marks_json ->> 'Maths' AS INT) > 90;

Display NAME and Marks Scored in Physics subject:

In [ ]:
SELECT name, CAST(marks_json ->> 'Physics' AS INT) AS "Marks Scored in Physics"
FROM student_marks;

Display NAME and Maximum-Subject-Marks:

In [ ]:
SELECT name, GREATEST(
  CAST(marks_json ->> 'Maths' AS INT),
  CAST(marks_json ->> 'Physics' AS INT),
  CAST(marks_json ->> 'Chemistry' AS INT)
) AS "Maximum-Subject-Marks"
FROM student_marks;

Display NAME and Average Marks Scored:

In [ ]:
SELECT name,
  (CAST(marks_json ->> 'Maths' AS INT) + CAST(marks_json ->> 'Physics' AS INT) + CAST(marks_json ->> 'Chemistry' AS INT)) / 3.0 AS "Average Marks Scored"
FROM student_marks;

Display NAME and Percentage of Marks:

In [ ]:
SELECT name,
  (CAST(marks_json ->> 'Maths' AS INT) + CAST(marks_json ->> 'Physics' AS INT) + CAST(marks_json ->> 'Chemistry' AS INT)) * 100.0 / (3 * 100) AS "Percentage of marks"
FROM student_marks;

Problem Statement 04

Create a table “student_info” with schema as show below and load the data

In [ ]:
CREATE TABLE student_info (
  name STRING,
  marks MAP<STRING, INT>,
  address STRUCT<
    doorNo INT,
    Location STRING,
    Pincode INT
  >
);

Display all "NAME" who is located in Banashankari:

In [ ]:
SELECT name
FROM student_info
WHERE address.Location = 'Banashankari';

Calculate the total count of students staying in pin code 560001:

In [ ]:
SELECT COUNT(*) AS total_count
FROM student_info
WHERE address.Pincode = 560001;